<?php
$book = [
  1 => [
    "name" => "Введение",
    "content" => [
      1 => [
        "name" => "Об этом курсе",
        "content" => [
          1 => "Об этом курсе",
        ]
      ],
      2 => [
        "name" => "О чём нужно знать",
        "content" => [
          1 => "Компилятор для C",
          2 => "Система",
        ]
      ],
    ]
  ],
  2 => [
    "name" => "Вид сверху на C",
    "content" => [
      1 => [
        "name" => "Введение",
        "content" => [
          1 => "Функция main",
          2 => "Функция puts",
          3 => "Локальные переменные и функция printf",
          4 => "Целочисленные типы данных",
          5 => "Арифметические и логические операторы",
          6 => "Задача: Вывести текст",
          7 => "Задача: Почему bool?",
          8 => "Задача: Какой размер у int?",
        ]
      ],
      2 => [
        "name" => "Контроль потока",
        "content" => [
          1 => "Statements и Expressions",
          2 => "Control Flow, if",
          3 => "Функция scanf",
          4 => "Задача: На if",
          5 => "Циклы while и do while",
          6 => "Цикл for",
          7 => "Задача: Запутанный for",
          8 => "break, continue и goto",
          9 => "switch case default",
          10 => "Задача: На цикл",
        ]
      ],
      3 => [
        "name" => "Функции",
        "content" => [
          1 => "Функции",
          2 => "Аргументы программы argv",
          3 => "Прототипы",
          4 => "Задача: Набор простых функций",
          5 => "Функции с переменным количеством аргументов",
          6 => "Задача: Набор простых функций с переменным количеством аргументов",
          7 => "Задача: Найти уязвимость",]
      ],
      4 => [
        "name" => "Указатели",
        "content" => [
          1 => "Объявления указателей, разыменование",
          2 => "Массивы",
          3 => "Указатели и массивы",
          4 => "Задача: Написать любую сортировку",
          5 => "Динамическое выделение памяти",
          6 => "Задача: Найти ошибки при работе с указателями",
          7 => "Задача: Написать сортировку слиянием",
          8 => "Многомерные динамические массивы",
          9 => "Задача: На обход граф",
          10 => "Константы",
          11 => "Задача: Сигнатура у функции execv",
        ]
      ],
      5 => [
        "name" => "Строки",
        "content" => [
          1 => "Представление строки, функция strlen",
          2 => "Задача: Почему ошибка исполнения?",
          3 => "Функции sprintf, strcpy, strncpy",
          4 => "Функции strcmp, atoi, strdup",
          5 => "Задача: Написать строковые функции",
          6 => "Функция strtok",
          7 => "Задача: Написать токенизирующую функцию",
          8 => "Функции mem***",
        ]
      ],
      6 => [
        "name" => "Структуры",
        "content" => [
          1 => "Кодирование целых чисел",
          2 => "Битовые операторы",
          3 => "Задача: На перебор масок",
          4 => "Кодирование вещественных чисел",
          5 => "Задача: О кодировании вещественных чисел",
          6 => "Перечисления enum и структуры struct",
          7 => "Задача: На связный список",
          8 => "Объединения union, typedef",
        ]
      ],
      7 => [
        "name" => "Функции высшего порядка, макросы, шаблоны",
        "content" => [
          1 => "Функции высшего порядка",
          2 => "Задача: О вложенных функциях",
          3 => "Макросы",
          4 => "Макросы для обобщённого программирования",
          5 => "Задача: Написать обобщённыю функцию",
          6 => "Имитация наследования",
          7 => "Задача: Что ещё можно сымитировать?",
        ]
      ],
    ]
  ],
  3 => [
    "name" => "Компиляция, gcc",
    "content" => [
      1 => [
        "name" => "Фазы компиляции",
        "content" => [
          1 => "Фазы компиляции",
          2 => "Препроцессирование",
          3 => "Компиляция",
          4 => "Ассемблирование",
          5 => "Компоновка",
          6 => "Задача: О памяти",
        ]
      ],
      2 => [
        "name" => "Многомодульные программы",
        "content" => [
          1 => "Прототипы и реализации функций",
          2 => "Заголовочные файлы",
          3 => "Header Guards",
          4 => "Библиотеки .a",
          5 => "Shared Objects .so",
          6 => "Задача: Нужны ли заголовочные файлы?",
        ]
      ],
      3 => [
        "name" => "GNU make",
        "content" => [
          1 => "Мотивация системы сборки",
          2 => "Простые рецепты",
          3 => "Зависимости в рецептах",
          4 => "Распараллеливание",
          5 => "Автоматический поиск файлов",
          6 => "Вложенные Makefiles",
          7 => "Задача: Улучшение структуры Makefiles",
          8 => "Задача: Как быть с заголовочными файлами?",
          9 => "Проект: Программа со структурой",
        ]
      ],
    ]
  ],
  4 => [
    "name" => "Unix",
    "content" => [
      1 => [
        "name" => "Shell",
        "content" => [
          1 => "Терминал и простые cli программы",
          2 => "Фоновые процессы",
          3 => "Потоки Streams",
          4 => "Аргументы программы и переменные среды",
          5 => "Код возврата процесса",
          6 => "Задача: Мини grep",
          7 => "Скрипты, Shebang",
          8 => "Статистика процессов",
          9 => "Задача: A + B на shell",
          10 => "Проект: Judge System",
        ]
      ],
      2 => [
        "name" => "Системные вызовы",
        "content" => [
          1 => "Системный вызов fork",
          2 => "Задача: fork-последовательность",
          3 => "Системный вызов exec",
          4 => "Системные вызовы open, read, write",
          5 => "Задача: Действия с файлами",
          6 => "Системный вызов pipe",
          7 => "Потоки Threads",
          8 => "Задача: Делегация обязанностей",
          9 => "Семафоры",
          10 => "Сигналы и обработчики сигналов",
          11 => "Проект: Shell",
        ]
      ],
      3 => [
        "name" => "Файловая система",
        "content" => [
          1 => "Монтирование",
          2 => "Loop Device",
          3 => "Разделы дисков Disk Partitions",
          4 => "Задача: формат GPT",
          5 => "Loop Devices и разделы",
          6 => "Задача: Манипуляции с диском при установке ОС",
          7 => "Системный вызов chroot",
          8 => "Проект: Containerization",
        ]
      ],
    ]
  ],
  5 => [
    "name" => "Assembly",
    "content" => [
      1 => [
        "name" => "Регистры, базовые инструкции",
        "content" => [
          1 => "Мотивация языка ассемблера",
          2 => "Структура кода на языке ассемблера",
          3 => "Дебаггер gdb",
          4 => "Инструкции mov и lea",
          5 => "Задача: Об инструкции lea",
          6 => "Разрядность",
          7 => "Как читать машинный код",
          8 => "Задача: Прочитать код инструкции",
          9 => "Синтаксис языка ассемблера",
          10 => "Арифмитические инструкции и флаги, как читать ISA",
          11 => "Control Flow",
          12 => "Задача: Написать циклы",
          13 => "Инструкции для строк и массивов",
          14 => "Задача: strcpy",
        ]
      ],
      2 => [
        "name" => "Application Binary Interface",
        "content" => [
          1 => "Функции и стек",
          2 => "Вызов функций в 32-bit",
          3 => "Задача: На цикл, но на языке ассемблера с libc",
          4 => "System V ABI",
          5 => "Вызов функций в 64-bit, системный вызов",
          6 => "Задача: Системный вызов exit",
          7 => "Системные вызовы fork, read, write",
          8 => "Задача: На цикл, но на языке ассемблера без libc",
          9 => "Анализ вывода компилятора gcc в 64-bit",
          10 => "Анализ вывода компилятора gcc в 32-bit",
          11 => "Проект: Компилятор",
        ]
      ],
      3 => [
        "name" => "Компоновка",
        "content" => [
          1 => "Немного reverse engineering-а",
          2 => "Задача: Своя реализация функций для системных вызовов",
          3 => "Перегрузка и экранирование символов в C++",
          4 => "Анализ секций",
          5 => "Анализ сегментов",
          6 => "Задача: О Position Independent Code",
          7 => "Эксперименты с секциями",
          8 => "Linker Scripts и секции",
          9 => "Linker Scripts и сегменты",
          10 => "Задача: Написать Linker Script",
          11 => "Задача: Языки ассемблеров других архитектур",
        ]
      ],
      4 => [
        "name" => "Введение в Embedded Programming",
        "content" => [
          1 => "О написании операционных систем",
          2 => "Простейшее ядро, запускающееся grub-ом, и демонстрирующее VESA",
          3 => "Задача: Конфигурация grub-а с несколькими ядрами",
          4 => "Отладка с gdb. Немного о Real Mode и Protected Mode",
          5 => "Использование языка C",
          6 => "Задача: Функции вывода текста",
          7 => "Настройка прерываний Interrupts 1",
          8 => "Настройка прерываний Interrupts 2, исключения Exceptions",
          9 => "Задача: Обработчики прерываний",
          10 => "Задача: Простейшие ядра на других архитектурах",
        ]
      ],
    ]
  ],
];
?>
