<?php
$book = [
  1 => [
    "name" => "Введение",
    "content" => [
      1 => [
        "name" => "Об этом курсе",
        "size" => 1,
      ],
      2 => [
        "name" => "О чём нужно знать",
        "size" => 2,
      ],
    ]
  ],
  2 => [
    "name" => "Вид сверху на C",
    "content" => [
      1 => [
        "name" => "Введение",
        "size" => 8,
      ],
      2 => [
        "name" => "Контроль потока",
        "size" => 10,
      ],
      3 => [
        "name" => "Функции",
        "size" => 7,
      ],
      4 => [
        "name" => "Указатели",
        "size" => 11,
      ],
      5 => [
        "name" => "Строки",
        "size" => 8,
      ],
      6 => [
        "name" => "Структуры",
        "size" => 8,
      ],
      7 => [
        "name" => "Функции высшего порядка, макросы, шаблоны",
        "size" => 7,
      ],
    ]
  ],
  3 => [
    "name" => "Компиляция, gcc",
    "content" => [
      1 => [
        "name" => "Фазы компиляции",
        "size" => 6,
      ],
      2 => [
        "name" => "Многомодульные программы",
        "size" => 6,
      ],
      3 => [
        "name" => "GNU make",
        "size" => 9,
      ],
    ]
  ],
  4 => [
    "name" => "Unix",
    "content" => [
      1 => [
        "name" => "Shell",
        "size" => 10,
      ],
      2 => [
        "name" => "Системные вызовы",
        "size" => 11,
      ],
      3 => [
        "name" => "Файловая система",
        "size" => 8,
      ],
    ]
  ],
  5 => [
    "name" => "Assembly",
    "content" => [
      1 => [
        "name" => "Регистры, базовые инструкции",
        "size" => 14,
      ],
      2 => [
        "name" => "Application Binary Interface",
        "size" => 11,
      ],
      3 => [
        "name" => "Компоновка",
        "size" => 11,
      ],
    ]
  ],
];
?>
